manuals/Prodam/RecepcaoRPS_Novo/Exemplo_Completo.XML

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inv="InvoiCy">
   <soapenv:Header/>
   <soapenv:Body>
      <inv:recepcao.Execute>
         <inv:Invoicyrecepcao>
            <inv:Cabecalho>
               <inv:EmpPK>AkmtCCt8Vh5iMJD92E9HYQ==</inv:EmpPK>
               <inv:EmpCK>e329dba77ffc32073482e9923ea4ed4f</inv:EmpCK>
               <inv:EmpCO></inv:EmpCO>
            </inv:Cabecalho>
            <inv:Informacoes>
               <inv:Texto></inv:Texto>
            </inv:Informacoes>
            <inv:Dados>
               <inv:DadosItem>
                  <inv:Documento>&lt;Envio&gt;&lt;ModeloDocumento&gt;aaaaaaaaaa&lt;/ModeloDocumento&gt;&lt;Versao&gt;12.12&lt;/Versao&gt;&lt;RPS&gt;&lt;RPSNumero&gt;123456789123456&lt;/RPSNumero&gt;&lt;RPSSerie&gt;aaaaa&lt;/RPSSerie&gt;&lt;RPSTipo&gt;1&lt;/RPSTipo&gt;&lt;dEmis&gt;2001-12-17T09:30:47Z&lt;/dEmis&gt;&lt;dCompetencia&gt;1967-08-13&lt;/dCompetencia&gt;&lt;LocalPrestServ&gt;5&lt;/LocalPrestServ&gt;&lt;natOp&gt;1234&lt;/natOp&gt;&lt;Operacao&gt;aa&lt;/Operacao&gt;&lt;NumProcesso&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/NumProcesso&gt;&lt;RegEspTrib&gt;1&lt;/RegEspTrib&gt;&lt;OptSN&gt;1&lt;/OptSN&gt;&lt;IncCult&gt;0&lt;/IncCult&gt;&lt;Status&gt;1&lt;/Status&gt;&lt;cVerificaRPS&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/cVerificaRPS&gt;&lt;EmpreitadaGlobal&gt;1&lt;/EmpreitadaGlobal&gt;&lt;tpAmb&gt;1&lt;/tpAmb&gt;&lt;RPSSubs&gt;&lt;SubsNumero&gt;123456789123456&lt;/SubsNumero&gt;&lt;SubsSerie&gt;aaaaa&lt;/SubsSerie&gt;&lt;SubsTipo&gt;1&lt;/SubsTipo&gt;&lt;SubsNFSeNumero&gt;123456789123456&lt;/SubsNFSeNumero&gt;&lt;SubsDEmisNFSe&gt;2001-12-17T09:30:47Z&lt;/SubsDEmisNFSe&gt;&lt;/RPSSubs&gt;&lt;Prestador&gt;&lt;CNPJ_prest&gt;aaaaaaaaaaaaaa&lt;/CNPJ_prest&gt;&lt;CPF_prest&gt;aaaaaaaaaaa&lt;/CPF_prest&gt;&lt;xNome&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/xNome&gt;&lt;xFant&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/xFant&gt;&lt;IM&gt;aaaaaaaaaaaaaaa&lt;/IM&gt;&lt;IE&gt;aaaaaaaaaaaaaa&lt;/IE&gt;&lt;CMC&gt;123456789123456&lt;/CMC&gt;&lt;enderPrest&gt;&lt;TPEnd&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/TPEnd&gt;&lt;xLgr&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/xLgr&gt;&lt;nro&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/nro&gt;&lt;xCpl&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/xCpl&gt;&lt;xBairro&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/xBairro&gt;&lt;cMun&gt;1234567&lt;/cMun&gt;&lt;UF&gt;aa&lt;/UF&gt;&lt;CEP&gt;12345678&lt;/CEP&gt;&lt;fone&gt;12345678912345&lt;/fone&gt;&lt;Email&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/Email&gt;&lt;/enderPrest&gt;&lt;/Prestador&gt;&lt;ListaItens&gt;&lt;Item&gt;&lt;ItemSeq&gt;1234&lt;/ItemSeq&gt;&lt;ItemCod&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/ItemCod&gt;&lt;ItemDesc&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/ItemDesc&gt;&lt;ItemQtde&gt;1234567891234.12&lt;/ItemQtde&gt;&lt;ItemvUnit&gt;1234567891234.12&lt;/ItemvUnit&gt;&lt;ItemuMed&gt;aaaaaaaaaa&lt;/ItemuMed&gt;&lt;ItemvlDed&gt;1234567891234.12&lt;/ItemvlDed&gt;&lt;ItemTributavel&gt;aa&lt;/ItemTributavel&gt;&lt;ItemcCnae&gt;1234567&lt;/ItemcCnae&gt;&lt;ItemTributMunicipio&gt;aaaaaaaaaaaaaaaaaaaa&lt;/ItemTributMunicipio&gt;&lt;ItemnAlvara&gt;aaaaaaaaaaaaaaa&lt;/ItemnAlvara&gt;&lt;ItemvIss&gt;12345678912345.12&lt;/ItemvIss&gt;&lt;ItemvDesconto&gt;12345678912345.12&lt;/ItemvDesconto&gt;&lt;ItemAliquota&gt;12.1234&lt;/ItemAliquota&gt;&lt;ItemVlrTotal&gt;12345678912.1234&lt;/ItemVlrTotal&gt;&lt;ItemBaseCalculo&gt;12345678912345.12&lt;/ItemBaseCalculo&gt;&lt;ItemvlrISSRetido&gt;12345678912345.12&lt;/ItemvlrISSRetido&gt;&lt;ItemIssRetido&gt;1&lt;/ItemIssRetido&gt;&lt;ItemRespRetencao&gt;1&lt;/ItemRespRetencao&gt;&lt;ItemIteListServico&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/ItemIteListServico&gt;&lt;ItemExigibilidadeISS&gt;12&lt;/ItemExigibilidadeISS&gt;&lt;ItemcMunIncidencia&gt;1234567&lt;/ItemcMunIncidencia&gt;&lt;ItemNumProcesso&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/ItemNumProcesso&gt;&lt;ItemDedTipo&gt;a&lt;/ItemDedTipo&gt;&lt;ItemDedCPFRef&gt;aaaaaaaaaaa&lt;/ItemDedCPFRef&gt;&lt;ItemDedCNPJRef&gt;aaaaaaaaaaaaaa&lt;/ItemDedCNPJRef&gt;&lt;ItemDedNFRef&gt;123456789123456&lt;/ItemDedNFRef&gt;&lt;ItemDedvlTotRef&gt;12345678912345.12&lt;/ItemDedvlTotRef&gt;&lt;ItemDedPer&gt;12345678912345.12&lt;/ItemDedPer&gt;&lt;ItemDedValor&gt;12345678912345.12&lt;/ItemDedValor&gt;&lt;ItemVlrLiquido&gt;12345678912345.12&lt;/ItemVlrLiquido&gt;&lt;ItemValAliqINSS&gt;12.1234&lt;/ItemValAliqINSS&gt;&lt;ItemValINSS&gt;12345678912345.12&lt;/ItemValINSS&gt;&lt;ItemValAliqIR&gt;12.1234&lt;/ItemValAliqIR&gt;&lt;ItemValIR&gt;12345678912345.12&lt;/ItemValIR&gt;&lt;ItemValAliqCOFINS&gt;12.1234&lt;/ItemValAliqCOFINS&gt;&lt;ItemValCOFINS&gt;12345678912345.12&lt;/ItemValCOFINS&gt;&lt;ItemValAliqCSLL&gt;12.1234&lt;/ItemValAliqCSLL&gt;&lt;ItemValCSLL&gt;12345678912345.12&lt;/ItemValCSLL&gt;&lt;ItemValAliqPIS&gt;12.1234&lt;/ItemValAliqPIS&gt;&lt;ItemValPIS&gt;12345678912345.12&lt;/ItemValPIS&gt;&lt;ItemRedBCRetido&gt;12345678912345.12&lt;/ItemRedBCRetido&gt;&lt;ItemBCRetido&gt;12345678912345.12&lt;/ItemBCRetido&gt;&lt;ItemPaisImpDevido&gt;BR&lt;/ItemPaisImpDevido&gt;&lt;ItemValAliqISSRetido&gt;12345678912345.12&lt;/ItemValAliqISSRetido&gt;&lt;ItemCST&gt;1234&lt;/ItemCST&gt;&lt;ItemJustDed&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/ItemJustDed&gt;&lt;/Item&gt;&lt;/ListaItens&gt;&lt;ListaParcelas&gt;&lt;Parcela&gt;&lt;PrcSequencial&gt;12345678&lt;/PrcSequencial&gt;&lt;PrcValor&gt;12345678912345.12&lt;/PrcValor&gt;&lt;PrcDtaVencimento&gt;1967-08-13&lt;/PrcDtaVencimento&gt;&lt;PrcNroFatura&gt;123456789123456&lt;/PrcNroFatura&gt;&lt;PrcTipVenc&gt;1&lt;/PrcTipVenc&gt;&lt;PrcDscTipVenc&gt;aaaaaaaaaaaaaaa&lt;/PrcDscTipVenc&gt;&lt;/Parcela&gt;&lt;/ListaParcelas&gt;&lt;Servico&gt;&lt;Valores&gt;&lt;ValServicos&gt;12345678912345.12&lt;/ValServicos&gt;&lt;ValDeducoes&gt;12345678912345.12&lt;/ValDeducoes&gt;&lt;ValPIS&gt;12345678912345.12&lt;/ValPIS&gt;&lt;ValCOFINS&gt;12345678912345.12&lt;/ValCOFINS&gt;&lt;ValINSS&gt;12345678912345.12&lt;/ValINSS&gt;&lt;ValIR&gt;12345678912345.12&lt;/ValIR&gt;&lt;ValCSLL&gt;12345678912345.12&lt;/ValCSLL&gt;&lt;ISSRetido&gt;0&lt;/ISSRetido&gt;&lt;RespRetencao&gt;1&lt;/RespRetencao&gt;&lt;Tributavel&gt;aa&lt;/Tributavel&gt;&lt;ValISS&gt;12345678912345.12&lt;/ValISS&gt;&lt;ValISSRetido&gt;12345678912345.12&lt;/ValISSRetido&gt;&lt;ValOutrasRetencoes&gt;12345678912345.12&lt;/ValOutrasRetencoes&gt;&lt;ValBaseCalculo&gt;12345678912345.12&lt;/ValBaseCalculo&gt;&lt;ValAliqISS&gt;12.1234&lt;/ValAliqISS&gt;&lt;ValAliqPIS&gt;12.1234&lt;/ValAliqPIS&gt;&lt;ValAliqCOFINS&gt;12.1234&lt;/ValAliqCOFINS&gt;&lt;ValAliqIR&gt;12.1234&lt;/ValAliqIR&gt;&lt;ValAliqCSLL&gt;12.1234&lt;/ValAliqCSLL&gt;&lt;ValAliqINSS&gt;12.1234&lt;/ValAliqINSS&gt;&lt;ValLiquido&gt;12345678912345.12&lt;/ValLiquido&gt;&lt;ValDescIncond&gt;12345678912345.12&lt;/ValDescIncond&gt;&lt;ValDescCond&gt;12345678912345.12&lt;/ValDescCond&gt;&lt;ValAliqISSoMunic&gt;12.1234&lt;/ValAliqISSoMunic&gt;&lt;InfValPIS&gt;12345678912345.12&lt;/InfValPIS&gt;&lt;InfValCOFINS&gt;12345678912345.12&lt;/InfValCOFINS&gt;&lt;ValLiqFatura&gt;12345678912345.12&lt;/ValLiqFatura&gt;&lt;ValBCISSRetido&gt;12345678912345.12&lt;/ValBCISSRetido&gt;&lt;NroFatura&gt;123456789123456&lt;/NroFatura&gt;&lt;CargaTribValor&gt;12345678912345.12&lt;/CargaTribValor&gt;&lt;CargaTribPercentual&gt;1234.1234&lt;/CargaTribPercentual&gt;&lt;CargaTribFonte&gt;aaaaaaaaaa&lt;/CargaTribFonte&gt;&lt;JustDed&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/JustDed&gt;&lt;/Valores&gt;&lt;LocalPrestacao&gt;&lt;SerEndTpLgr&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/SerEndTpLgr&gt;&lt;SerEndLgr&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/SerEndLgr&gt;&lt;SerEndNumero&gt;aaaaaaaaaa&lt;/SerEndNumero&gt;&lt;SerEndComplemento&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/SerEndComplemento&gt;&lt;SerEndBairro&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/SerEndBairro&gt;&lt;SerEndxMun&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/SerEndxMun&gt;&lt;SerEndcMun&gt;1234567&lt;/SerEndcMun&gt;&lt;SerEndCep&gt;12345678&lt;/SerEndCep&gt;&lt;SerEndSiglaUF&gt;aa&lt;/SerEndSiglaUF&gt;&lt;/LocalPrestacao&gt;&lt;IteListServico&gt;aaaaaaaaaaaaaaa&lt;/IteListServico&gt;&lt;Cnae&gt;1234567&lt;/Cnae&gt;&lt;fPagamento&gt;aa&lt;/fPagamento&gt;&lt;TributMunicipio&gt;aaaaaaaaaaaaaaaaaaaa&lt;/TributMunicipio&gt;&lt;TributMunicDesc&gt;aaaaaaaaaaaaaaaaaaaa&lt;/TributMunicDesc&gt;&lt;Discriminacao&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/Discriminacao&gt;&lt;cMun&gt;1234567&lt;/cMun&gt;&lt;SerQuantidade&gt;12345678912345.12&lt;/SerQuantidade&gt;&lt;SerUnidade&gt;aaaaaaaaaa&lt;/SerUnidade&gt;&lt;SerNumAlva&gt;aaaaaaaaaaaaaaa&lt;/SerNumAlva&gt;&lt;PaiPreServico&gt;aa&lt;/PaiPreServico&gt;&lt;cMunIncidencia&gt;1234567&lt;/cMunIncidencia&gt;&lt;dVencimento&gt;1967-08-13&lt;/dVencimento&gt;&lt;ObsInsPagamento&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/ObsInsPagamento&gt;&lt;ObrigoMunic&gt;12&lt;/ObrigoMunic&gt;&lt;TributacaoISS&gt;12&lt;/TributacaoISS&gt;&lt;CodigoAtividadeEconomica&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/CodigoAtividadeEconomica&gt;&lt;ServicoViasPublicas&gt;1234&lt;/ServicoViasPublicas&gt;&lt;NumeroParcelas&gt;2&lt;/NumeroParcelas&gt;&lt;NroOrcamento&gt;12&lt;/NroOrcamento&gt;&lt;/Servico&gt;&lt;Tomador&gt;&lt;TomaCNPJ&gt;aaaaaaaaaaaaaa&lt;/TomaCNPJ&gt;&lt;TomaCPF&gt;aaaaaaaaaaa&lt;/TomaCPF&gt;&lt;TomaIM&gt;aaaaaaaaaaaaaaa&lt;/TomaIM&gt;&lt;TomaRazaoSocial&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/TomaRazaoSocial&gt;&lt;TomatpLgr&gt;aaaaaaaaaa&lt;/TomatpLgr&gt;&lt;TomaEndereco&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/TomaEndereco&gt;&lt;TomaNumero&gt;aaaaaaaaaa&lt;/TomaNumero&gt;&lt;TomaComplemento&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/TomaComplemento&gt;&lt;TomaBairro&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/TomaBairro&gt;&lt;TomacMun&gt;1234567&lt;/TomacMun&gt;&lt;TomaxMun&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/TomaxMun&gt;&lt;TomaUF&gt;aa&lt;/TomaUF&gt;&lt;TomaPais&gt;aa&lt;/TomaPais&gt;&lt;TomaCEP&gt;aaaaaaaaaa&lt;/TomaCEP&gt;&lt;TomaTelefone&gt;aaaaaaaaaaa&lt;/TomaTelefone&gt;&lt;TomaTipoTelefone&gt;aa&lt;/TomaTipoTelefone&gt;&lt;TomaEmail&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/TomaEmail&gt;&lt;TomaSite&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/TomaSite&gt;&lt;TomaIE&gt;aaaaaaaaaaaaaaa&lt;/TomaIE&gt;&lt;TomaIME&gt;aaaaaaaaaaaaaaa&lt;/TomaIME&gt;&lt;TomaSituacaoEspecial&gt;a&lt;/TomaSituacaoEspecial&gt;&lt;DocTomadorEstrangeiro&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/DocTomadorEstrangeiro&gt;&lt;/Tomador&gt;&lt;IntermServico&gt;&lt;IntermRazaoSocial&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/IntermRazaoSocial&gt;&lt;IntermCNPJ&gt;aaaaaaaaaaaaaa&lt;/IntermCNPJ&gt;&lt;IntermCPF&gt;aaaaaaaaaaa&lt;/IntermCPF&gt;&lt;IntermIM&gt;aaaaaaaaaaaaaaa&lt;/IntermIM&gt;&lt;IntermEmail&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/IntermEmail&gt;&lt;IntermEndereco&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/IntermEndereco&gt;&lt;IntermNumero&gt;aaaaaaaaaa&lt;/IntermNumero&gt;&lt;IntermComplemento&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/IntermComplemento&gt;&lt;IntermBairro&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/IntermBairro&gt;&lt;IntermCep&gt;aaaaaaaaaa&lt;/IntermCep&gt;&lt;IntermCmun&gt;1234567&lt;/IntermCmun&gt;&lt;IntermXmun&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/IntermXmun&gt;&lt;IntermFone&gt;aaaaaaaaaaa&lt;/IntermFone&gt;&lt;ItermIE&gt;aaaaaaaaaaaaaaa&lt;/ItermIE&gt;&lt;/IntermServico&gt;&lt;ConstCivil&gt;&lt;CodObra&gt;aaaaaaaaaaaaaaa&lt;/CodObra&gt;&lt;Art&gt;aaaaaaaaaaaaaaa&lt;/Art&gt;&lt;ObraLog&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/ObraLog&gt;&lt;ObraCompl&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/ObraCompl&gt;&lt;ObraNumero&gt;aaaaaaaaaa&lt;/ObraNumero&gt;&lt;ObraBairro&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/ObraBairro&gt;&lt;ObraCEP&gt;12345678&lt;/ObraCEP&gt;&lt;ObraMun&gt;1234567&lt;/ObraMun&gt;&lt;ObraUF&gt;aa&lt;/ObraUF&gt;&lt;ObraPais&gt;aa&lt;/ObraPais&gt;&lt;ObraCEI&gt;aaaaaaaaaaaaaaa&lt;/ObraCEI&gt;&lt;ObraMatricula&gt;aaaaaaaaaaaaaaa&lt;/ObraMatricula&gt;&lt;ObraValRedBC&gt;12345678912345.12&lt;/ObraValRedBC&gt;&lt;ObraTipo&gt;1&lt;/ObraTipo&gt;&lt;ListaMaterial&gt;&lt;Material&gt;&lt;MatCodigo&gt;aaaaaaaaaaaaaaaaaaaa&lt;/MatCodigo&gt;&lt;MatDescricao&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/MatDescricao&gt;&lt;MatUndMedCodigo&gt;aaaaaaaaaaaaaaaaaaaa&lt;/MatUndMedCodigo&gt;&lt;MatUndMedSigla&gt;aaaaaaa&lt;/MatUndMedSigla&gt;&lt;MatQuantidade&gt;1234&lt;/MatQuantidade&gt;&lt;MatVlrTotal&gt;12345678912345.12&lt;/MatVlrTotal&gt;&lt;/Material&gt;&lt;/ListaMaterial&gt;&lt;/ConstCivil&gt;&lt;ListaDed&gt;&lt;Ded&gt;&lt;DedSeq&gt;123456789123456789&lt;/DedSeq&gt;&lt;DedValPer&gt;aaa&lt;/DedValPer&gt;&lt;DedTipo&gt;aaa&lt;/DedTipo&gt;&lt;DedCNPJRef&gt;aaaaaaaaaaaaaa&lt;/DedCNPJRef&gt;&lt;DedCPFRef&gt;aaaaaaaaaaa&lt;/DedCPFRef&gt;&lt;DednNFRef&gt;1234567891&lt;/DednNFRef&gt;&lt;DedvlTotRef&gt;12345678912345.12&lt;/DedvlTotRef&gt;&lt;DedPer&gt;12345678912345.12&lt;/DedPer&gt;&lt;DedValor&gt;12345678912345.12&lt;/DedValor&gt;&lt;DedQtde&gt;12345678912345.12&lt;/DedQtde&gt;&lt;DedValUnit&gt;12345678912345.12&lt;/DedValUnit&gt;&lt;DedDescricao&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/DedDescricao&gt;&lt;/Ded&gt;&lt;/ListaDed&gt;&lt;Transportadora&gt;&lt;TraNome&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/TraNome&gt;&lt;TraCPFCNPJ&gt;aaaaaaaaaaaaaa&lt;/TraCPFCNPJ&gt;&lt;TraIE&gt;aaaaaaaaaaaaaaa&lt;/TraIE&gt;&lt;TraPlaca&gt;aaaaaaaaaa&lt;/TraPlaca&gt;&lt;TraEnd&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/TraEnd&gt;&lt;TraMun&gt;1234567&lt;/TraMun&gt;&lt;TraUF&gt;aa&lt;/TraUF&gt;&lt;TraPais&gt;aa&lt;/TraPais&gt;&lt;TraTipoFrete&gt;1&lt;/TraTipoFrete&gt;&lt;/Transportadora&gt;&lt;NFSOutrasinformacoes&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/NFSOutrasinformacoes&gt;&lt;RPSCanhoto&gt;0&lt;/RPSCanhoto&gt;&lt;Arquivo&gt;aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa&lt;/Arquivo&gt;&lt;ExtensaoArquivo&gt;aaaaa&lt;/ExtensaoArquivo&gt;&lt;/RPS&gt;&lt;/Envio&gt;</inv:Documento>
                  <inv:Parametros></inv:Parametros>
               </inv:DadosItem>
            </inv:Dados>
         </inv:Invoicyrecepcao>
      </inv:recepcao.Execute>
   </soapenv:Body>
</soapenv:Envelope>